syfchao/STM32_RTT_F107/components/DeviceDrivers/usart5.c
/*****************************************************************************/
/* File      : usart5.c                                                      */
/*****************************************************************************/
/*  History:                                                                 */
/*****************************************************************************/
/*  Date       * Author          * Changes                                   */
/*****************************************************************************/
/*  2017-06-02 * Shengfeng Dong  * Creation of the file                      */
/*             *                 *                                           */
/*****************************************************************************/

/*****************************************************************************/
/*  Include Files                                                            */
/*****************************************************************************/
#include "usart5.h"	
#include "SEGGER_RTT.h"
#include "timer.h"
#include "string.h"
#include "stm32f10x.h"
#include "rthw.h"
#include "stdio.h"
#include "rtthread.h"
#include "stdlib.h"
#include "debug.h"
#include "client.h"
#include "threadlist.h"
#include "clientSocket.h"
#include "file.h"
#include "datetime.h"
#include "mcp1316.h"
#include "powerIO.h"


/*****************************************************************************/
/*  Definitions                                                              */
/*****************************************************************************/
rt_mutex_t wifi_uart_lock = RT_NULL;
extern unsigned char APSTA_Status;

/*****************************************************************************/
/*  Function Implementations                                                 */
/*****************************************************************************/
Socket_Cfg client_arg;
Socket_Cfg control_client_arg;

void initSocketArgs(void)
{
    FILE *fp;
    char *buff = NULL;
    client_arg.port1 = CLIENT_SERVER_PORT1;
    client_arg.port2 = CLIENT_SERVER_PORT2;
    strcpy(client_arg.domain, CLIENT_SERVER_DOMAIN);
    strcpy(client_arg.ip, CLIENT_SERVER_IP);

    buff = malloc(512);
    memset(buff,'\0',512);
    //初始化电量上传参数
    fp = fopen("/yuneng/datacent.con", "r");
    if(fp)
    {
        while(1)
        {
            memset(buff, '\0', 512);
            fgets(buff, 512, fp);

            if(!strlen(buff))
                break;
            if(!strncmp(buff, "Domain", 6))
            {
                strcpy(client_arg.domain, &buff[7]);
                if('\n' == client_arg.domain[strlen(client_arg.domain)-1])
                    client_arg.domain[strlen(client_arg.domain)-1] = '\0';
            }
            if(!strncmp(buff, "IP", 2))
            {
                strcpy(client_arg.ip, &buff[3]);
                if('\n' == client_arg.ip[strlen(client_arg.ip)-1])
                    client_arg.ip[strlen(client_arg.ip)-1] = '\0';
            }
            if(!strncmp(buff, "Port1", 5))
                client_arg.port1=atoi(&buff[6]);
            if(!strncmp(buff, "Port2", 5))
                client_arg.port2=atoi(&buff[6]);
        }
        fclose(fp);
    }

    //初始化远程控制参数
    control_client_arg.port1 = CONTROL_SERVER_PORT1;
    control_client_arg.port2 = CONTROL_SERVER_PORT2;
    ;	strcpy(control_client_arg.domain, CONTROL_SERVER_DOMAIN);
    strcpy(control_client_arg.ip, CONTROL_SERVER_IP);
    control_client_arg.timeout = 10;
    control_client_arg.report_interval = 15;
    fp = fopen("/yuneng/control.con", "r");
    if(fp)
    {
        while(1)
        {
            memset(buff, '\0',512);
            fgets(buff, 512, fp);
            if(!strlen(buff))
                break;
            if(!strncmp(buff, "Domain", 6))
            {
                strcpy(control_client_arg.domain, &buff[7]);
                if('\n' == control_client_arg.domain[strlen(control_client_arg.domain)-1])
                    control_client_arg.domain[strlen(control_client_arg.domain)-1] = '\0';
            }
            if(!strncmp(buff, "IP", 2))
            {
                strcpy(control_client_arg.ip, &buff[3]);
                if('\n' == control_client_arg.ip[strlen(control_client_arg.ip)-1])
                    control_client_arg.ip[strlen(control_client_arg.ip)-1] = '\0';
            }
            if(!strncmp(buff, "Port1", 5))
                control_client_arg.port1=atoi(&buff[6]);
            if(!strncmp(buff, "Port2", 5))
                control_client_arg.port2=atoi(&buff[6]);

            if(!strncmp(buff, "Timeout", 7))
            {
                control_client_arg.timeout = atoi(&buff[8]);
            }

            if(!strncmp(buff, "Report_Interval", 15))
            {
                control_client_arg.report_interval = atoi(&buff[16]);
            }
        }
        fclose(fp);
    }

    printf("client_arg.domain:%s\n",client_arg.domain);
    printf("client_arg.ip:%s\n",client_arg.ip);
    printf("client_arg.port1:%d\n",client_arg.port1);
    printf("client_arg.port2:%d\n",client_arg.port2);

    printf("client_arg.domain:%s\n",control_client_arg.domain);
    printf("client_arg.ip:%s\n",control_client_arg.ip);
    printf("client_arg.port1:%d\n",control_client_arg.port1);
    printf("client_arg.port2:%d\n",control_client_arg.port2);
    printf("client_arg.timeout:%d\n",control_client_arg.timeout);
    printf("client_arg.report_interval:%d\n",control_client_arg.report_interval);

    free(buff);
    buff = NULL;
}


/* 随机取port1或port2 */
int randport(Socket_Cfg cfg)
{
    srand((unsigned)acquire_time());
    if(rand()%2)
        return cfg.port1;
    else
        return cfg.port2;
}
//4个字节
unsigned short packetlen_A(unsigned char *packet)
{
    unsigned short len = 0;
    len = ((packet[0]-'0')*1000 +(packet[1]-'0')*100 + (packet[2]-'0')*10 + (packet[3]-'0'));
    return len;
}

//2个字节
unsigned short packetlen_B(unsigned char *packet)
{
    unsigned short len = 0,count = 0;
    count = (packet[0] - '0') * 10 + (packet[1] - '0');
    len =  3 + 9 + count *14;
    return len;

