syfchao/STM32_RTT_F107/components/DeviceDrivers/usart5.c
}

//5个字节
unsigned short packetlen_C(unsigned char *packet)
{
    unsigned short len = 0;
    int i = 0;
    for(i = 0;i < 5;i++)
    {
        if(packet[i] == 'A') packet[i] = '0';
    }
    len = ((packet[0]-'0')*10000 +(packet[1]-'0')*1000 + (packet[2]-'0')*100 + (packet[3]-'0')*10 + (packet[4]-'0'));
    return len;
}

//WIFI发送函数 
int WIFI_SendData(char *data, int num)
{      
    int index = 0;
    char ch = 0;
    for(index = 0;index < num;index++)
    {
        ch = data[index];
        while(USART_GetFlagStatus(UART5,USART_FLAG_TC)==RESET);
        USART_SendData(UART5,(uint16_t)ch);
    }
    return index;
}


//初始化IO 串口5
//bound:波特率
void uart5_init(u32 bound){
    //GPIO端口设置
    GPIO_InitTypeDef GPIO_InitStructure;
    USART_InitTypeDef USART_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);	//使能串口时钟UART5
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC|RCC_APB2Periph_GPIOD|RCC_APB2Periph_AFIO, ENABLE);	//使能GPIOA时钟

    //USART_DeInit(UART5);  //复位串口5
    //UART5_TX   PC.12
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12; //PC.12
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;	//复用推挽输出
    GPIO_Init(GPIOC, &GPIO_InitStructure); //初始化PC12

    //UART5_RX	  PD.2
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;//浮空输入
    GPIO_Init(GPIOD, &GPIO_InitStructure);  //初始化PD2
    //USART 初始化设置

    USART_InitStructure.USART_BaudRate = bound;//一般设置为9600;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;//字长为8位数据格式
    USART_InitStructure.USART_StopBits = USART_StopBits_1;//一个停止位
    USART_InitStructure.USART_Parity = USART_Parity_No;//无奇偶校验位
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//无硬件数据流控制
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;	//收发模式

    USART_Init(UART5, &USART_InitStructure); //初始化串口

    //UART5 NVIC 配置
    NVIC_InitStructure.NVIC_IRQChannel = UART5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=0;//抢占优先级3
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;		//子优先级3
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ通道使能
    NVIC_Init(&NVIC_InitStructure);	//根据指定的参数初始化VIC寄存器

    USART_ITConfig(UART5, USART_IT_RXNE, ENABLE);//开启中断
    USART_Cmd(UART5, ENABLE);                    //使能串口

}


//WIFI  socket A 当串口发出来的数据组包成功时 ,数组赋值，并且Socket事件变为1
unsigned char WIFI_RecvSocketAData[SOCKETA_LEN] = {'\0'};
unsigned char WIFI_Recv_SocketA_Event = 0;
unsigned int WIFI_Recv_SocketA_LEN =0;
char TCPServerConnectID = '0';

char ConnectID = '0';

//WIFI  socket B 当串口发出来的数据组包成功时 ,数组赋值，并且Socket事件变为1
unsigned char WIFI_RecvSocketBData[SOCKETB_LEN] = {'\0'};
unsigned char WIFI_Recv_SocketB_Event = 0;
unsigned int WIFI_Recv_SocketB_LEN =0;

//WIFI  socket C 当串口发出来的数据组包成功时 ,数组赋值，并且Socket事件变为1
unsigned char WIFI_RecvSocketCData[SOCKETC_LEN] = {'\0'};
unsigned char WIFI_Recv_SocketC_Event = 0;
unsigned int WIFI_Recv_SocketC_LEN =0;


//wifi  串口当前收到的数据 
unsigned char USART_RX_BUF[USART_REC_LEN];     			//接收缓冲,最大USART_REC_LEN个字节.
unsigned short Cur = 0;															//当前采值位置														//数据解析位置

void UART5_IRQHandler(void)                	//串口1中断服务程序
{
    if(USART_GetITStatus(UART5, USART_IT_RXNE) != RESET)  //接收中断(接收到的数据必须是0x0d 0x0a结尾)
    {
        USART_RX_BUF[Cur] = USART_ReceiveData(UART5);//(UART5->DR);	//读取接收到的数据
        //SEGGER_RTT_printf(0, "[%d] : %x %c\n",Cur,USART_RX_BUF[Cur],USART_RX_BUF[Cur]);
        Cur +=1;
        if(Cur >=USART_REC_LEN)
        {
            Cur = 0;
        }
    }
}

void clear_WIFI(void)
{
    //TIM3_Int_Deinit();
    Cur = 0;
}



//判断字符中是否有OK  字符
int detectionOK(int size)		//检测到OK  返回1   未检出到返回0
{
    int i=0;
    for(i = 0;i<(size-2);i++)
    {
        if(!memcmp(&USART_RX_BUF[i],"OK",2))
        {
            return 1;
        }
    }
    return 0;
}

int detectionUNLINK(int size)		//检测到OK  返回1   未检出到返回0
{
    int i=0;
    for(i = 0;i<(size-2);i++)
    {
        if(!memcmp(&USART_RX_BUF[i],"UNLINK",6))
        {
            return 1;
        }
    }
    return 0;
}

//判断字符中是否有Ai-Thinker Technology Co. Ltd.  字符
int detectionResetStatus(int size)		//检测到Ai-Thinker Technology Co. Ltd.  返回1   未检出到返回0
{
    int i=0;
    for(i = 0;i<(size-30);i++)
    {
        if(!memcmp(&USART_RX_BUF[i],"Ai-Thinker Technology Co. Ltd.",30))
        {
            if(APSTA_Status == 1)
            {
                AT_CWMODE3(3);
	       printf("AP\n");
                AT_CIPMUX1();
                AT_CIPSERVER();
                AT_CIPSTO();
            }else
            {
                printf("STA\n");
                AT_CWMODE3(1);
                AT_CIPMUX1();
            }

            return 1;
        }
    }
    return 0;
}

//判断字符中是否有OK  字符
int detectionSENDOK(int size)		//检测到OK  返回1   未检出到返回0
{
    int i=0;
    for(i = 0;i<(size-7);i++)
    {
        if(!memcmp(&USART_RX_BUF[i],"SEND OK",7))
        {
            return 1;
        }
    }
    return 0;
}

//判断字符中是否有+IPD
int detectionIPD(int size)
{
    int i=0,j=0;
    char messageLen[5] = {'\0'};
    int len = 0;

    for(i = 0;i<(size-4);i++)
    {
        if(!memcmp(&USART_RX_BUF[i],"+IPD",4))
        {
            ConnectID = USART_RX_BUF[i+5];
            memcpy(messageLen,&USART_RX_BUF[i+7],4);
            for(j = 0;j<4;j++)
            {
                if(messageLen[j] == ':')
                {
                    messageLen[j] = '\0';
                    //printf("%c %d,%s\n",USART_RX_BUF[i+5],j,messageLen);
                    len = atoi(messageLen);
                    break;
                }
            }
            if((size - i -7-j) >=len)
            {
                if('4'==ConnectID)
                {
                    memcpy(WIFI_RecvSocketCData,&USART_RX_BUF[i+8+j],len );
                    WIFI_RecvSocketCData[len] = '\0';
                    WIFI_Recv_SocketC_Event = 1;
                    WIFI_Recv_SocketC_LEN =len;
                    //printf("C:%s\n",WIFI_RecvSocketCData);
                }else if('3' == ConnectID){
                    memcpy(WIFI_RecvSocketBData,&USART_RX_BUF[i+8+j],len );
                    WIFI_RecvSocketBData[len] = '\0';
                    WIFI_Recv_SocketB_Event = 1;
                    WIFI_Recv_SocketB_LEN =len;
                    //printf("B:%s\n",WIFI_RecvSocketBData);
                }else
                {
                    TCPServerConnectID = ConnectID;
                    memcpy(WIFI_RecvSocketAData,&USART_RX_BUF[i+8+j],len );
                    WIFI_RecvSocketAData[len] = '\0';
                    WIFI_Recv_SocketA_Event = 1;
                    WIFI_Recv_SocketA_LEN =len;
                    //printf("A:%s\n",WIFI_RecvSocketAData);
                }
                Cur = 0;
                return 1;
            }
            break;

