syfchao/STM32_RTT_F107/components/DeviceDrivers/usart5.c
        }
    }
    return 0;
}

void WIFI_GetEvent_ESP07S(void)
{
    //判断ECU_R数据大于38个字节
    detectionIPD(Cur);
    detectionResetStatus(Cur);
}

int WIFI_Reset(void)
{
    rt_hw_powerIO_off();
    rt_hw_ms_delay(1000);
    rt_hw_powerIO_on();
    return 0;
}

char sendbuff[4096] = {'\0'};

int ESP07S_sendData(char *data ,int length)
{
    int i = 0;
    clear_WIFI();
    WIFI_SendData(data,length);
    for(i = 0;i< 100;i++)
    {
        if(1 == detectionSENDOK(Cur))
        {
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;

}

int SendToSocket(char connectID,char *data ,int length)
{
    int send_length = 0;	//需要发送的字节位置
    while(length > 0)
    {
        memset(sendbuff,'\0',4096);
        if(length > 1460)
        {
            memcpy(sendbuff,&data[send_length],1460);
            AT_CIPSEND(connectID,1460);
            ESP07S_sendData(sendbuff,1460);
            //rt_hw_ms_delay(230);
            send_length += 1460;
            length -= 1460;
        }else
        {
            memcpy(sendbuff,&data[send_length],length);
            AT_CIPSEND(connectID,length);
            ESP07S_sendData(sendbuff,length);
            length -= length;

            return 0;
        }

    }
    AT_CIPCLOSE(connectID);
    return -1;
}


//SOCKET A 发送数据  \n需要在传入字符串中带入
int SendToSocketA(char *data ,int length)
{
    return SendToSocket(TCPServerConnectID,data,length);
}

//SOCKET B 发送数据
int SendToSocketB(char *IP ,int port,char *data ,int length)
{
    WIFI_Recv_SocketB_Event = 0;
    if(!AT_CIPSTART('3',"TCP",IP ,port))
    {
        //printf("SendToSocketB: ino AT_CIPSTART\n");
        return SendToSocket('3',data,length);
    }
    return -1;
}

//SOCKET C 发送数据
int SendToSocketC(char *IP ,int port,char *data ,int length)
{
    char msg_length[6] = {'\0'};

    if(data[strlen(data)-1] == '\n'){
        sprintf(msg_length, "%05d", strlen(data)-1);
    }
    else{
        sprintf(msg_length, "%05d", strlen(data));
        strcat(data, "\n");
        length++;
    }
    strncpy(&data[5], msg_length, 5);
    WIFI_Recv_SocketC_Event = 0;
    print2msg(ECU_DBG_CONTROL_CLIENT,"Sent", data);
    if(!AT_CIPSTART('4',"TCP",IP ,port))
    {
        //printf("SendToSocketC: ino AT_CIPSTART\n");
        return SendToSocket('4',data,length);
    }
    return -1;
}

//----ESP01流程-------------------------------
int AT_CWMODE3(int mode)			//配置WIFI模块为AP+STA模式1.STA模式 3.AP+STA模式
{
    int i = 0;
    clear_WIFI();
    if(mode == 1)
    {
        WIFI_SendData("AT+CWMODE_DEF=1\r\n", 17);
    }else if(mode == 3)
    {
        WIFI_SendData("AT+CWMODE_DEF=3\r\n", 17);
    }else
    {
        return -1;
    }



    for(i = 0;i< 100;i++)
    {
        if(1 == detectionOK(Cur))
        {
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;

}
int AT_RST(void)			//复位WIFI模块
{
    int i = 0;
    clear_WIFI();
    //发送"AT+Z\n",返回+ok
    WIFI_SendData("AT+RST\r\n", 8);
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionOK(Cur))
        {
            printf("AT+RST :+ok\n");
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;

}


int WIFI_Test(void)
{
    int i = 0;
    clear_WIFI();
    //发送"AT+Z\n",返回+ok
    WIFI_SendData("AT\r\n", 8);
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionOK(Cur))
        {
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
        MCP1316_kickwatchdog();
    }
    clear_WIFI();
    return -1;
}

int AT_CWSAP(char *ECUID,char *PASSWD)			//配置ECU热点名字
{
    int i = 0;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CWSAP_DEF=\"ECU_R_%s\",\"%s\",11,3\r\n",ECUID,PASSWD);
    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionOK(Cur))
        {
            printf("%s",AT);
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;

}

int WIFI_Factory_Passwd(void)
{
    char ECUID[13] = {'\0'};
    int res = 0;
    AT_CWMODE3(3);


    get_ecuid(ECUID);
    res = AT_CWSAP(ECUID,"88888888");
    AT_CWMODE3(1);
    AT_CIPMUX1();
    if(!res)
        return 0;
    else
        return -1;
}

int AT_CWJAP(char *SSID,char *PASSWD)			//配置ECU连接无线路由器名
{
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CWJAP_DEF=\"%s\",\"%s\"\r\n",SSID,PASSWD);
    printf("%s",AT);
    WIFI_SendData(AT, (strlen(AT)+1));

    return 0;
}

int AT_CWJAP_DEF(char *SSID,char *PASSWD)			//配置ECU连接无线路由器名
{
    int i = 0;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CWJAP_DEF=\"%s\",\"%s\"\r\n",SSID,PASSWD);

    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 1500;i++)
    {
        if(1 == detectionOK(Cur))
        {
            printf("%s",AT);
            clear_WIFI();
            return 0;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return -1;
}

//判断字符中是否有OK  字符	LinksStatus:连接状态 0表示未连接 1表示已连接
int detectionJAPStatus(int size,char *info,unsigned char *LinksStatus)		//检测到OK  返回1   未检出到返回0
{
    int i=0,j=0,SSIDStart = 0,SSIDEnd = 0;
    *LinksStatus = 0;
    for(i = 0;i<(size-2);i++)
    {
        if(!memcmp(&USART_RX_BUF[i],"OK",2))
        {
            for(j = 0;j < i;j++)
            {
                if(!memcmp(&USART_RX_BUF[j],"+CWJAP:\"",8))
                {
                    SSIDStart = j+7;
                    for(j=SSIDStart;j < i;j++)
                    {
                        if('\r' == USART_RX_BUF[j])
                        {

                            SSIDEnd = j;
                            break;
                        }
                    }
                    memcpy(info,&USART_RX_BUF[SSIDStart],(SSIDEnd-SSIDStart));
                    *LinksStatus = 1;
                    return 1;
                }
            }
            *LinksStatus = 0;
            return 1;
        }
    }
    return -1;
}

int AT_CWJAPStatus(char *info)			//查询ECU连接无线路由器名 返回1表示获取成功连接，返回0表示未连接
{
    int i = 0;
    unsigned char LinksStatus;
    char AT[100] = { '\0' };
    clear_WIFI();
    sprintf(AT,"AT+CWJAP?\r\n");

    WIFI_SendData(AT, (strlen(AT)+1));
    for(i = 0;i< 200;i++)
    {
        if(1 == detectionJAPStatus(Cur,info,&LinksStatus))
        {
            printf("AT+AT_CWJAPStatus :+ok:%d\n",LinksStatus);
            clear_WIFI();
            return LinksStatus;
        }
        rt_thread_delay(1);
    }
    clear_WIFI();
    return 0;
}


int detectionLAPList(int size,char *str)		//检测到OK  返回1   未检出到返回0
{
    int i=0,j=0;
    for(i = 0;i<(size-2);i++)
    {
        if(!memcmp(&USART_RX_BUF[i],"OK",2))
        {
            for(j = 0;j < i;j++)
            {
                if(!memcmp(&USART_RX_BUF[j],"+CWLAP:",7))
                {
                    memcpy(str,&USART_RX_BUF[j],(i-j-4));
                    str[i-j-4] = '\0';
                    printf("list:%d %d %d  %s\n",i,j,strlen(str),str);
                    return 1;
                }
            }
            return 1;
        }
    }
    return -1;
}


